Repository: Kamikazie98/wqa
Catalog: lib/l10n/app_*.arb
Languages: fa

# appTitle
source: Waiq Assistant
fa: دستیار وایک

source: Loading...
fa: در حال بارگذاری...

source: Update Required
fa: به‌روزرسانی لازم است

# updateMessage
source: Version {latestVersion} is available. Please update the application to continue.
fa: نسخه {latestVersion} منتشر شده است. برای ادامه لطفاً اپلیکیشن را به‌روز کنید.

# updateMessageGeneric
source: Please update the application to the latest version to continue.
fa: برای ادامه لطفاً اپلیکیشن را به آخرین نسخه به‌روز کنید.

source: Download Update
fa: دانلود به‌روزرسانی

# downloadLinkUnavailable
source: Download link is not available.
fa: لینک دانلود در دسترس نیست.

# permissionsTitle
source: Waiq Permissions
fa: مجوزهای Waiq

# permissionsDescription
source: For smart functionality, we need a few permissions. You can manage each item separately.
fa: برای کارکرد هوشمند، چند دسترسی لازم داریم. هر مورد را می‌توانی جداگانه مدیریت کنی.

# mainPermissions
source: Main Permissions (In-app)
fa: مجوزهای اصلی (درون‌اپی)

source: Notification
fa: نوتیفیکیشن

# notificationDescription
source: To send smart notifications and event updates.
fa: برای ارسال اعلان‌های هوشمند و بروزرسانی رویدادها.

source: Location
fa: موقعیت مکانی

# locationDescription
source: For detecting modes, location automation, and sense service.
fa: برای تشخیص حالت‌ها، اتوماسیون مکانی و سرویس سنس.

source: Phone
fa: تماس‌ها (Phone)

# phoneDescription
source: To run call-related automations.
fa: برای اجرای اتوماسیون‌های مربوط به تماس.

source: SMS
fa: پیامک (SMS)

# smsDescription
source: To send/read SMS in automations.
fa: برای ارسال/خواندن SMS در اتوماسیون‌ها.

source: Microphone
fa: میکروفون

# microphoneDescription
source: For voice assistant and voice-based interactions.
fa: برای دستیار صوتی و تعامل‌های مبتنی بر صدا.

source: Calendar
fa: تقویم

# calendarDescription
source: To read and manage calendar events.
fa: برای خواندن و مدیریت رویدادهای تقویم.

# systemSettings
source: System Settings (From Android Settings)
fa: تنظیمات سیستمی (از تنظیمات اندروید)

# usageAccess
source: Usage Access (Reading running apps)
fa: Usage Access (خواندن اپ‌های در حال استفاده)

# usageAccessDescription
source: To understand which app is currently in the foreground. After opening the page, find Waiq and enable Allow.
fa: برای فهمیدن اینکه الان کدام اپ در foreground است. بعد از باز شدن صفحه، Waiq را پیدا کن و Allow را فعال کن.

# notificationListenerDescription
source: This permission is required to receive and analyze device notification information. To enable: 1) Go to Settings > Apps > (waiq) > Permissions > Allow restricted settings, 2) Then go to Settings > Notifications > Device & app notifications and enable the corresponding option. If you are on HyperOS/MIUI phones, make sure the Battery controller is set to No restrictions and MIUI/HyperOS optimization is disabled.
fa: این اجازه برای دریافت و تحلیل اطلاعات نوتیفیکیشن‌های دستگاه لازم است. برای فعال‌کردن: ۱) به Settings > Apps > (waiq) > Permissions > Allow restricted settings برو، ۲) سپس به Settings > Notifications > Device & app notifications برو و گزینه مربوطه را فعال کن. اگر روی گوشی‌های HyperOS/MIUI هستی، مطمئن شو Battery کنترل‌کننده No restrictions باشد و MIUI/HyperOS بهینه‌سازی غیرفعال است.

# batteryOptimizationDescription
source: To prevent Waiq from being automatically closed in the background. On the opened page, set the app to "No restrictions".
fa: برای جلوگیری از بستن خودکار Waiq در پس‌زمینه. در صفحه باز شده، اپ را روی "No restrictions" بگذار.

source: Continue to App
fa: ادامه به برنامه

# permissionsRequiredMessage
source: At least notification and location permissions must be enabled to continue.
fa: برای ادامه حداقل نوتیفیکیشن و موقعیت مکانی باید فعال باشند.

source: Open Settings
fa: باز کردن تنظیمات

source: Activate
fa: فعال‌سازی

# restrictedSettingsHint
source: If the notification switch is gray: Go to Settings > Apps > (waiq) > â‹® > Allow restricted settings, unlock the screen, and confirm. Then go back to Settings > Notifications > Device & app notifications and turn on the switch. On HyperOS/MIUI, if it's still gray, set Battery to No restrictions and turn MIUI/HyperOS optimization off and on once.
fa: اگر سوییچ اعلان خاکستری است: Settings > Apps > (waiq) > ⋮ > Allow restricted settings را بزن، قفل صفحه را باز کن و تأیید کن. سپس به Settings > Notifications > Device & app notifications برگرد و سوییچ را روشن کن. در HyperOS/MIUI اگر هنوز خاکستری بود، Battery را روی No restrictions بگذار و MIUI/HyperOS optimization را یک بار خاموش/روشن کن.

# noGoalSuggestions
source: No goal suggestions available.
fa: هیچ پیشنهاد هدفی موجود نیست.

source: Message Analysis
fa: تحلیل پیام

# enterMessageHint
source: Enter a message to analyze...
fa: یک پیام برای تحلیل وارد کنید...

source: Analyze
fa: تحلیل

source: Analysis Results
fa: نتایج تحلیل

# analysisError
source: An error occurred during analysis: {error}
fa: خطایی در هنگام تحلیل رخ داد: {error}

# clearCacheConfirmation
source: Are you sure you want to clear the cache?
fa: آیا برای پاک کردن حافظه پنهان مطمئن هستید؟

# clearCacheDescription
source: This will reduce the application size.
fa: این کار باعث کاهش حجم اپلیکیشن خواهد شد.

source: Cache cleared
fa: حافظه پنهان پاک شد

source: Export Data
fa: خروجی گرفتن از داده‌ها

# exportDataDescription
source: Export all of your data
fa: از تمام داده‌های خود خروجی بگیرید

source: Exporting data...
fa: در حال خروجی گرفتن از داده‌ها...

source: Import Data
fa: وارد کردن داده‌ها

# importDataDescription
source: Restore from a backup
fa: بازیابی از یک نسخه پشتیبان

source: Daily Program
fa: برنامه روزانه

# noEvents
source: No events for today
fa: رویدادی برای امروز وجود ندارد

source: No goals found
fa: هیچ هدفی یافت نشد

# error
source: Error: {error}
fa: خطا: {error}

# progress
source: Progress: {progress}
fa: پیشرفت: {progress}

# deadline
source: Deadline: {deadline}
fa: موعد: {deadline}

source: Description:
fa: توضیح:

source: Milestones:
fa: مراحل:

source: No milestones
fa: بدون مرحله

source: No data available
fa: اطلاعات موجود نیست

source: Goal Stats
fa: آمار اهداف

source: Total Goals
fa: کل اهداف

source: Active
fa: فعال

source: Completed
fa: تکمیل شده

source: On Track
fa: موقع مقررد

source: Average Progress:
fa: میانگین پیشرفت:

source: At Risk:
fa: در خطر:

source: Dislike
fa: نمی‌پسندم

source: Like
fa: می‌پسندم

source: No groups yet.
fa: هنوز گروهی وجود ندارد.

# noHabitsTracked
source: No habits tracked yet.
fa: هنوز عادتی دنبال نشده است.

source: Streak
fa: تداوم
